load-tests/results/resultados.txt
[INFO] Scanning for projects...
Downloading from central: https://repo.maven.apache.org/maven2/org/apache/maven/plugins/maven-metadata.xml
Downloading from central: https://repo.maven.apache.org/maven2/io/gatling/maven-metadata.xml
Downloading from central: https://repo.maven.apache.org/maven2/org/codehaus/mojo/maven-metadata.xml
Downloaded from central: https://repo.maven.apache.org/maven2/org/apache/maven/plugins/maven-metadata.xml (14 kB at 27 kB/s)
Downloaded from central: https://repo.maven.apache.org/maven2/io/gatling/maven-metadata.xml (562 B at 1.0 kB/s)
Downloaded from central: https://repo.maven.apache.org/maven2/org/codehaus/mojo/maven-metadata.xml (21 kB at 36 kB/s)
[INFO]
[INFO] -----------< io.gatling.demo:gatling-maven-plugin-demo-java >-----------
[INFO] Building gatling-maven-plugin-demo-java 3.15.0
[INFO]   from pom.xml
[INFO] --------------------------------[ jar ]---------------------------------
[INFO]
[INFO] >>> gatling:4.21.5:test (default-cli) > test-compile @ gatling-maven-plugin-demo-java >>>
[INFO]
[INFO] --- resources:3.5.0:resources (default-resources) @ gatling-maven-plugin-demo-java ---
[INFO] skip non existing resourceDirectory C:\Users\Fernando\Desktop\gatling-maven-plugin-demo-java-main\gatling-maven-plugin-demo-java-main\src\main\resources
[INFO]
[INFO] --- compiler:3.15.0:compile (default-compile) @ gatling-maven-plugin-demo-java ---
[INFO] No sources to compile
[INFO]
[INFO] --- resources:3.5.0:testResources (default-testResources) @ gatling-maven-plugin-demo-java ---
[INFO] Copying 4 resources from src\test\resources to target\test-classes
[INFO]
[INFO] --- compiler:3.15.0:testCompile (default-testCompile) @ gatling-maven-plugin-demo-java ---
[INFO] Recompiling the module because of changed source code.
[INFO] Compiling 1 source file with javac [debug release 11] to target\test-classes
[INFO]
[INFO] <<< gatling:4.21.5:test (default-cli) < test-compile @ gatling-maven-plugin-demo-java <<<
[INFO]
[INFO]
[INFO] --- gatling:4.21.5:test (default-cli) @ gatling-maven-plugin-demo-java ---
[INFO] Running simulation io.gatling.example.YoviSimulation.
Simulation io.gatling.example.YoviSimulation started...

========================================================================================================================
2026-04-20 20:58:30 GMT                                                                               5s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |        29 |        29 |         0
> register                                                                           |        10 |        10 |         0
> login                                                                              |         8 |         8 |         0
> create_game                                                                        |         6 |         6 |         0
> resign_game                                                                        |         3 |         3 |         0
> stats_me                                                                           |         1 |         1 |         0
> stats_history                                                                      |         1 |         1 |         0

---- register-login-play-resign-stats ----------------------------------------------------------------------------------
[||||||||||                                                                                                     ]  0.83%
          waiting:       109 / active:        10  / done:         1
========================================================================================================================


========================================================================================================================
2026-04-20 20:58:35 GMT                                                                              10s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |        89 |        89 |         0
> register                                                                           |        20 |        20 |         0
> login                                                                              |        18 |        18 |         0
> create_game                                                                        |        16 |        16 |         0
> resign_game                                                                        |        13 |        13 |         0
> stats_me                                                                           |        11 |        11 |         0
> stats_history                                                                      |        11 |        11 |         0

---- register-login-play-resign-stats ----------------------------------------------------------------------------------
[##########|||||||||                                                                                            ]  9.17%
          waiting:       100 / active:         9  / done:        11
========================================================================================================================


========================================================================================================================
2026-04-20 20:58:40 GMT                                                                              15s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |       149 |       149 |         0
> register                                                                           |        30 |        30 |         0
> login                                                                              |        28 |        28 |         0
> create_game                                                                        |        26 |        26 |         0
> resign_game                                                                        |        23 |        23 |         0
> stats_me                                                                           |        21 |        21 |         0
> stats_history                                                                      |        21 |        21 |         0

---- register-login-play-resign-stats ----------------------------------------------------------------------------------
[###################|||||||||                                                                                   ]  17.5%
          waiting:        90 / active:         9  / done:        21
========================================================================================================================


========================================================================================================================
2026-04-20 20:58:45 GMT                                                                              20s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |       209 |       209 |         0
> register                                                                           |        40 |        40 |         0
> login                                                                              |        38 |        38 |         0
> create_game                                                                        |        36 |        36 |         0
> resign_game                                                                        |        33 |        33 |         0
> stats_me                                                                           |        31 |        31 |         0
> stats_history                                                                      |        31 |        31 |         0

---- register-login-play-resign-stats ----------------------------------------------------------------------------------
[############################|||||||||                                                                          ] 25.83%
          waiting:        80 / active:         9  / done:        31
========================================================================================================================


========================================================================================================================
2026-04-20 20:58:50 GMT                                                                              25s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |       269 |       269 |         0
> register                                                                           |        50 |        50 |         0
> login                                                                              |        48 |        48 |         0
> create_game                                                                        |        46 |        46 |         0
> resign_game                                                                        |        43 |        43 |         0
> stats_me                                                                           |        41 |        41 |         0
> stats_history                                                                      |        41 |        41 |         0

---- register-login-play-resign-stats ----------------------------------------------------------------------------------
[#####################################|||||||||                                                                 ] 34.17%
          waiting:        70 / active:         9  / done:        41
========================================================================================================================


========================================================================================================================
2026-04-20 20:58:55 GMT                                                                              30s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |       329 |       329 |         0
> register                                                                           |        60 |        60 |         0
> login                                                                              |        58 |        58 |         0
> create_game                                                                        |        56 |        56 |         0
> resign_game                                                                        |        53 |        53 |         0
> stats_me                                                                           |        51 |        51 |         0
> stats_history                                                                      |        51 |        51 |         0

---- register-login-play-resign-stats ----------------------------------------------------------------------------------
[###############################################|||||||||                                                       ]  42.5%
          waiting:        60 / active:         9  / done:        51
========================================================================================================================


========================================================================================================================
2026-04-20 20:59:00 GMT                                                                              35s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |       389 |       389 |         0
> register                                                                           |        70 |        70 |         0
> login                                                                              |        68 |        68 |         0
> create_game                                                                        |        66 |        66 |         0
> resign_game                                                                        |        63 |        63 |         0
> stats_me                                                                           |        61 |        61 |         0
> stats_history                                                                      |        61 |        61 |         0

---- register-login-play-resign-stats ----------------------------------------------------------------------------------
[########################################################|||||||||                                              ] 50.83%
          waiting:        50 / active:         9  / done:        61
========================================================================================================================


========================================================================================================================
2026-04-20 20:59:05 GMT                                                                              40s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |       449 |       449 |         0
> register                                                                           |        80 |        80 |         0
> login                                                                              |        78 |        78 |         0
> create_game                                                                        |        76 |        76 |         0
> resign_game                                                                        |        73 |        73 |         0
> stats_me                                                                           |        71 |        71 |         0
> stats_history                                                                      |        71 |        71 |         0

---- register-login-play-resign-stats ----------------------------------------------------------------------------------
[#################################################################|||||||||                                     ] 59.17%
          waiting:        40 / active:         9  / done:        71
========================================================================================================================


========================================================================================================================
2026-04-20 20:59:10 GMT                                                                              45s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |       509 |       509 |         0
> register                                                                           |        90 |        90 |         0
> login                                                                              |        88 |        88 |         0
> create_game                                                                        |        86 |        86 |         0
> resign_game                                                                        |        83 |        83 |         0
> stats_me                                                                           |        81 |        81 |         0
> stats_history                                                                      |        81 |        81 |         0

---- register-login-play-resign-stats ----------------------------------------------------------------------------------
[##########################################################################|||||||||                            ]  67.5%
          waiting:        30 / active:         9  / done:        81
========================================================================================================================


========================================================================================================================
2026-04-20 20:59:15 GMT                                                                              50s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |       569 |       569 |         0
> register                                                                           |       100 |       100 |         0
> login                                                                              |        98 |        98 |         0
> create_game                                                                        |        96 |        96 |         0
> resign_game                                                                        |        93 |        93 |         0
> stats_me                                                                           |        91 |        91 |         0
> stats_history                                                                      |        91 |        91 |         0

---- register-login-play-resign-stats ----------------------------------------------------------------------------------
[####################################################################################||||||||||                 ] 75.83%
          waiting:        19 / active:        10  / done:        91
========================================================================================================================


========================================================================================================================
2026-04-20 20:59:20 GMT                                                                              55s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |       629 |       629 |         0
> register                                                                           |       110 |       110 |         0
> login                                                                              |       108 |       108 |         0
> create_game                                                                        |       106 |       106 |         0
> resign_game                                                                        |       103 |       103 |         0
> stats_me                                                                           |       101 |       101 |         0
> stats_history                                                                      |       101 |       101 |         0

---- register-login-play-resign-stats ----------------------------------------------------------------------------------
[#############################################################################################|||||||||         ] 84.17%
          waiting:        10 / active:         9  / done:       101
========================================================================================================================


========================================================================================================================
2026-04-20 20:59:25 GMT                                                                              60s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |       689 |       689 |         0
> register                                                                           |       120 |       120 |         0
> login                                                                              |       118 |       118 |         0
> create_game                                                                        |       116 |       116 |         0
> resign_game                                                                        |       113 |       113 |         0
> stats_me                                                                           |       111 |       111 |         0
> stats_history                                                                      |       111 |       111 |         0

---- register-login-play-resign-stats ----------------------------------------------------------------------------------
[######################################################################################################|||||||||]  92.5%
          waiting:         0 / active:         9  / done:       111
========================================================================================================================


========================================================================================================================
2026-04-20 20:59:30 GMT                                                                              64s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |       720 |       720 |         0
> register                                                                           |       120 |       120 |         0
> login                                                                              |       120 |       120 |         0
> create_game                                                                        |       120 |       120 |         0
> resign_game                                                                        |       120 |       120 |         0
> stats_me                                                                           |       120 |       120 |         0
> stats_history                                                                      |       120 |       120 |         0

---- register-login-play-resign-stats ----------------------------------------------------------------------------------
[###############################################################################################################]   100%
          waiting:         0 / active:         0  / done:       120
========================================================================================================================

Parsing log file(s)...
Parsing log file(s) done in 0s.
Generating reports...

========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |       720 |       720 |         -
> min response time (ms)                                                             |        90 |        90 |         -
> max response time (ms)                                                             |       224 |       224 |         -
> mean response time (ms)                                                            |       125 |       125 |         -
> response time std deviation (ms)                                                   |        40 |        40 |         -
> response time 50th percentile (ms)                                                 |        98 |        98 |         -
> response time 75th percentile (ms)                                                 |       177 |       177 |         -
> response time 95th percentile (ms)                                                 |       184 |       184 |         -
> response time 99th percentile (ms)                                                 |       198 |       198 |         -
> mean throughput (rps)                                                              |     11.08 |     11.08 |         -
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                            720   (100%)
> OK: 800 ms <= t < 1200 ms                                                                                   0     (0%)
> OK: t >= 1200 ms                                                                                            0     (0%)
> KO                                                                                                          0     (0%)
========================================================================================================================

Reports generated, please open the following file: file:///C:/Users/Fernando/Desktop/gatling-maven-plugin-demo-java-main/gatling-maven-plugin-demo-java-main/target/gatling/yovisimulation-20260420205825429/index.html
[INFO] ------------------------------------------------------------------------
[INFO] BUILD SUCCESS
[INFO] ------------------------------------------------------------------------
[INFO] Total time:  01:14 min
[INFO] Finished at: 2026-04-20T22:59:30+02:00
[INFO] ------------------------------------------------------------------------